<?php

return [
    // 引入来源
    'adapt_source' => [
        '厂商主动申请' => '厂商主动申请',
        'BD主动拓展' => 'BD主动拓展',
        '行业营销中心引入' => '行业营销中心引入',
        '区域营销中心引入' => '区域营销中心引入',
        '最终客户反馈' => '最终客户反馈',
        '产品经理引入' => '产品经理引入',
        '厂商合作事业本部引入' => '厂商合作事业本部引入',
        '渠道部引入'    => '渠道部引入',
        '相关机构反馈'  => '相关机构反馈',
        '其他方式引入'  => '其他方式引入',
    ],
    
    // 兼容等级
    'class' => [
        'READY'         => 'READY',
        'CERTIFICATION' => 'CERTIFICATION',
        'VALIDATION'    => 'VALIDATION',
        'PROJECT'       => 'PROJECT',
    ],

    // 适配类型
    'adaption_type' => [
        '原生适配'  => '原生适配',
        '自研适配'  => '自研适配',
        'KMRE'     => 'KMRE',
        'KWRE'     => 'KWRE',
        '网页'      => '网页',
        '开源适配'  => '开源适配',
        '项目适配'  => '项目适配',
    ],

    // 测试类型
    'test_type' => [
        '厂商自测'      => '厂商自测',
        '视频复测'      => '视频复测',
        '远程测试'      => '远程测试',
        '麒麟适配测试'  => '麒麟适配测试',
        '第三方测试'    => '第三方测试',
    ],

    // 行业
    'industry' => [
        '金融' => '金融',
        '电信' => '电信',
        '交通' => '交通',
        '能源' => '能源',
        '气象' => '气象',
        '电力' => '电力',
        '邮政' => '邮政',
        '医疗' => '医疗',
        '教育' => '教育',
        '党政' => '党政',
        '军工' => '军工',
        '通用' => '通用',
    ],

    'project_status' => [
        '招投标'    => '招投标',
        '实施阶段'  => '实施阶段',
        '运维阶段'  => '运维阶段',
    ],

    'project_level' => [
        '一般' => '一般',
        '紧急' => '紧急',
    ],
];
