<?php

return [
    // 引入来源
    'adapt_source' => [
        '厂商主动申请' => '厂商主动申请',
        'BD主动拓展' => 'BD主动拓展',
        '行业营销中心引入' => '行业营销中心引入',
        '区域营销中心引入' => '区域营销中心引入',
        '最终客户反馈' => '最终客户反馈',
        '产品经理引入' => '产品经理引入',
        '厂商合作事业本部引入' => '厂商合作事业本部引入',
        '渠道部引入' => '渠道部引入',
        '相关机构反馈' => '相关机构反馈',
        '其他方式引入' => '其他方式引入'
    ],
    
    // 兼容等级
    'class' => [
        'READY' => 'READY',
        'CERTIFICATION' => 'CERTIFICATION',
        'VALIDATION' => 'VALIDATION',
        'PM' => 'PM'
    ],

    // 适配类型
    'adaption_type' => [
        '原生适配' => '原生适配',
        '自研适配' => '自研适配',
        '开源适配' => '开源适配',
        '项目适配' => '项目适配'
    ],

    // 测试类型
    'test_type' => [
        '厂商自测' => '厂商自测',
        '视频复测' => '视频复测',
        '远程测试' => '远程测试',
        '麒麟适配测试' => '麒麟适配测试'
    ],
];
